In [1]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

<h5>Series : Any numpy type data with its index</h5>

In [2]:
egSeries = Series([4,3,-1,3], index = ['a','b','c','d'])    ##by default index is 0, 1, 2, 3
# You can also create a series by passing a python dict

In [3]:
print(egSeries)
print(egSeries.values)     ##egSeries.index will give array of indices
# print(e)

a    4
b    3
c   -1
d    3
dtype: int64
[ 4  3 -1  3]

In [4]:
print(egSeries[['b', 'a', 'c']])
print(egSeries[egSeries>0])
print(np.square(egSeries))   ## \to convert to array use egSeries.values
# NumPy array operations, such as filtering with a boolean array, 
# scalar multiplication, or applying math functions, will preserve the index-value link

b    3
a    4
c   -1
dtype: int64
a    4
b    3
d    3
dtype: int64
a    16
b     9
c     1
d     9
dtype: int64

In [5]:
print('b' in egSeries)
print('e' in egSeries)
print(egSeries.notnull())      #seriesobj.isnull(), seriesobj.notnull()

True
False
a    True
b    True
c    True
d    True
dtype: bool

A critical Series feature for many applications is that it automatically aligns differently 
indexed data in arithmetic operations

In [6]:
egSeries1 = Series([4,3,-1,3], index = ['b','a','c','d'])
print(egSeries+egSeries1)     #adds numbers automatically aligning their indexes

a    7
b    7
c   -2
d    6
dtype: int64

In [7]:
# name functionality
egSeries.name = 'integers'
egSeries.index.name = 'index of integers'
print(egSeries)

index of integers
a    4
b    3
c   -1
d    3
Name: integers, dtype: int64

<h5>Data Frame : tabular, spreadsheet-like data structure</h5>

In [8]:
# most common is from a dict of equal-length lists or NumPy arrays
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'], 
        'year': [2000, 2001, 2002, 2001, 2002], 
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)   
#orders the columns automatically else specify order eg : frame = DataFrame(data, columns=['year','state', 'pop'])
print(frame)
# As with Series, if you pass a column that isnâ€™t contained in data, it will appear with NA values in the result

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [9]:
# a column of dataFrame can be retrieved, eg : frame.state or frame['state']
# values of column can be given an assignment eg: frame.year = np.arange(4)
frame['debt'] = np.arange(5)     #assigning a col that doesnt exist will create the column
print(frame)
# del frame['debt']     to delete column "debt"

    state  year  pop  debt
0    Ohio  2000  1.5     0
1    Ohio  2001  1.7     1
2    Ohio  2002  3.6     2
3  Nevada  2001  2.4     3
4  Nevada  2002  2.9     4

In [10]:
# row and column can be named just like series
# Re arange the rows of data - Reindex
frame = frame.reindex([0,3,2,1,4,5])
print(frame)

    state    year  pop  debt
0    Ohio  2000.0  1.5   0.0
3  Nevada  2001.0  2.4   3.0
2    Ohio  2002.0  3.6   2.0
1    Ohio  2001.0  1.7   1.0
4  Nevada  2002.0  2.9   4.0
5     NaN     NaN  NaN   NaN

In [11]:
# Dropping entries from an axis
frame.drop([0,1], axis = 0)    #frame.drop(['debt'], axis = 1)

    state    year  pop  debt
3  Nevada  2001.0  2.4   3.0
2    Ohio  2002.0  3.6   2.0
4  Nevada  2002.0  2.9   4.0
5     NaN     NaN  NaN   NaN

In [12]:
# Indexing in dataframe
print(frame)
print(frame[1:4])
print(frame[frame['debt']<3])

    state    year  pop  debt
0    Ohio  2000.0  1.5   0.0
3  Nevada  2001.0  2.4   3.0
2    Ohio  2002.0  3.6   2.0
1    Ohio  2001.0  1.7   1.0
4  Nevada  2002.0  2.9   4.0
5     NaN     NaN  NaN   NaN
    state    year  pop  debt
3  Nevada  2001.0  2.4   3.0
2    Ohio  2002.0  3.6   2.0
1    Ohio  2001.0  1.7   1.0
  state    year  pop  debt
0  Ohio  2000.0  1.5   0.0
2  Ohio  2002.0  3.6   2.0
1  Ohio  2001.0  1.7   1.0

<h4>row-indexing</h4>
iloc loc

In [13]:
print(frame.loc[[1,2,3],['year','pop']])      ###read carefully - dataframe[[rows],[columns]]

     year  pop
1  2001.0  1.7
2  2002.0  3.6
3  2001.0  2.4

In [14]:
print(frame.loc[:,'state'])
print(frame.loc[3])

0      Ohio
3    Nevada
2      Ohio
1      Ohio
4    Nevada
5       NaN
Name: state, dtype: object
state    Nevada
year       2001
pop         2.4
debt          3
Name: 3, dtype: object

In [15]:
df1 = DataFrame(np.arange(9).reshape(3,3), columns = list('abc'))
df2 = DataFrame(np.arange(16).reshape(4,4), columns = list('abcd'))

In [16]:
df2+df1       #results in NaN for locations that dont overlap

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [17]:
df1.add(df2, fill_value = 0)    #add using a fill value at overlaping locations
# other functions - add, sub, mul, div

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

Operations betw Dataframe and series
-broadcasting similar to ndarray

In [18]:
ser = df1.iloc[0]
# ser = df1.iloc[:,0]
print(ser)
print(df1)
print(df1.sub(ser, axis = 1))    #broadcasting along rows   (df1 - ser) willl work
# print(df1.sub(ser, axis = 0))    #broadcasting along columns

a    0
b    1
c    2
Name: 0, dtype: int32
   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8
   a  b  c
0  0  0  0
1  3  3  3
2  6  6  6

In [19]:
# apply a function row-wise or column-wise
f = lambda x: x.max() - x.min()     #lambda is anonymous function
print(df1.apply(f))
print(df1.apply(f, axis = 1))

a    6
b    6
c    6
dtype: int64
0    2
1    2
2    2
dtype: int64

In [20]:
# apply function to each elements
f = lambda x: x*2
print(df1.applymap(f))

    a   b   c
0   0   2   4
1   6   8  10
2  12  14  16

In [21]:
# sorting by index
frame.sort_index()

    state    year  pop  debt
0    Ohio  2000.0  1.5   0.0
1    Ohio  2001.0  1.7   1.0
2    Ohio  2002.0  3.6   2.0
3  Nevada  2001.0  2.4   3.0
4  Nevada  2002.0  2.9   4.0
5     NaN     NaN  NaN   NaN

In [22]:
frame.sort_index(axis = 1, ascending = False)  # sort in descending

     year   state  pop  debt
0  2000.0    Ohio  1.5   0.0
3  2001.0  Nevada  2.4   3.0
2  2002.0    Ohio  3.6   2.0
1  2001.0    Ohio  1.7   1.0
4  2002.0  Nevada  2.9   4.0
5     NaN     NaN  NaN   NaN

In [23]:
#sorting by values
# FOR SERIES - obj.order()
#for dataframe if we have to sort by values in one of the columns
frame.sort_values(by = 'pop')

    state    year  pop  debt
0    Ohio  2000.0  1.5   0.0
1    Ohio  2001.0  1.7   1.0
3  Nevada  2001.0  2.4   3.0
4  Nevada  2002.0  2.9   4.0
2    Ohio  2002.0  3.6   2.0
5     NaN     NaN  NaN   NaN

In [24]:
#duplicate indices
dupe = df1.reindex([1,0,0,2,2])
dupe

   a  b  c
1  3  4  5
0  0  1  2
0  0  1  2
2  6  7  8
2  6  7  8

In [25]:
dupe.loc[0,:]    #will return a dataframe due to duplicate

   a  b  c
0  0  1  2
0  0  1  2

In [26]:
dupe.loc[1,:]   #will return a series, because no duplicates present

a    3
b    4
c    5
Name: 1, dtype: int32

In [27]:
# unique value
ser2 = Series(list('abbbac'))
print(ser2)
print(ser2.unique())
print(ser2.value_counts())  #alternatively--- pd.value_counts(ser2)

0    a
1    b
2    b
3    b
4    a
5    c
dtype: object
['a' 'b' 'c']
b    3
a    2
c    1
dtype: int64

In [28]:
# hierarchical indexing
df1 = DataFrame(np.arange(16).reshape(4,4), 
                index = [['a','a','b','b'],[1,2,1,2]], 
                columns = [['state', 'state', 'dist','dist'],['Mah','UP','Mum','BSB']])
print(df1)
print(df1.loc['a'])
print(df1.loc[:,'dist'])

    state     dist
      Mah  UP  Mum BSB
a 1     0   1    2   3
  2     4   5    6   7
b 1     8   9   10  11
  2    12  13   14  15
  state    dist
    Mah UP  Mum BSB
1     0  1    2   3
2     4  5    6   7
     Mum  BSB
a 1    2    3
  2    6    7
b 1   10   11
  2   14   15

In [29]:
# index and column name in hierarchical indexing
df1.index.names=['prime','sub']
df1.columns.names = ['Out','in']
df1

Out       state     dist
in          Mah  UP  Mum BSB
prime sub
a     1       0   1    2   3
      2       4   5    6   7
b     1       8   9   10  11
      2      12  13   14  15

In [30]:
# interchange level
print(df1.swaplevel('prime','sub'))
# note - here sub is level 0, and prime is level 1
print(df1.swaplevel('prime','sub').sort_index(0))    #sort_index on level 0

Out       state     dist
in          Mah  UP  Mum BSB
sub prime
1   a         0   1    2   3
2   a         4   5    6   7
1   b         8   9   10  11
2   b        12  13   14  15
Out       state     dist
in          Mah  UP  Mum BSB
sub prime
1   a         0   1    2   3
    b         8   9   10  11
2   a         4   5    6   7
    b        12  13   14  15

In [31]:
# statistics on levels
df1

Out       state     dist
in          Mah  UP  Mum BSB
prime sub
a     1       0   1    2   3
      2       4   5    6   7
b     1       8   9   10  11
      2      12  13   14  15

In [32]:
df1.sum(level = 'prime')

Out   state     dist
in      Mah  UP  Mum BSB
prime
a         4   6    8  10
b        20  22   24  26

In [33]:
df1.sum(level = 'Out', axis = 1)

Out        state  dist
prime sub
a     1        1     5
      2        9    13
b     1       17    21
      2       25    29

In [34]:
# using a column of a dataframe as index
frame

    state    year  pop  debt
0    Ohio  2000.0  1.5   0.0
3  Nevada  2001.0  2.4   3.0
2    Ohio  2002.0  3.6   2.0
1    Ohio  2001.0  1.7   1.0
4  Nevada  2002.0  2.9   4.0
5     NaN     NaN  NaN   NaN

In [35]:
frame.set_index(['state','year']).sort_index()
# frame.set_index(['state','year'], drop = False).sort_index()     # doesnt drop them as columns

               pop  debt
state  year
Nevada 2001.0  2.4   3.0
       2002.0  2.9   4.0
Ohio   2000.0  1.5   0.0
       2001.0  1.7   1.0
       2002.0  3.6   2.0
NaN    NaN     NaN   NaN

In [36]:
#reverse of set_index()
df1

Out       state     dist
in          Mah  UP  Mum BSB
prime sub
a     1       0   1    2   3
      2       4   5    6   7
b     1       8   9   10  11
      2      12  13   14  15

In [37]:
df1.reset_index()        #prime and sub become a column in the dataframe

Out prime sub state     dist
in              Mah  UP  Mum BSB
0       a   1     0   1    2   3
1       a   2     4   5    6   7
2       b   1     8   9   10  11
3       b   2    12  13   14  15

In [42]:
frame

    state    year  pop  debt
0    Ohio  2000.0  1.5   0.0
3  Nevada  2001.0  2.4   3.0
2    Ohio  2002.0  3.6   2.0
1    Ohio  2001.0  1.7   1.0
4  Nevada  2002.0  2.9   4.0
5     NaN     NaN  NaN   NaN

In [41]:
frame.groupby('year').mean()

         pop  debt
year
2000.0  1.50   0.0
2001.0  2.05   2.0
2002.0  3.25   3.0

In [48]:
state = frame.groupby('state')
state.get_group('Nevada')

    state    year  pop  debt
3  Nevada  2001.0  2.4   3.0
4  Nevada  2002.0  2.9   4.0

In [52]:
frame[frame['state']=='Nevada']

    state    year  pop  debt
3  Nevada  2001.0  2.4   3.0
4  Nevada  2002.0  2.9   4.0